zephyrproject-rtos/zephyr/drivers/interrupt_controller/intc_esp32.c
#if SOC_INT_PLIC_SUPPORTED
	/* Make sure the interrupt is not delegated to user mode (IDF uses machine mode only) */
	RV_CLEAR_CSR(mideleg, BIT(intr));
#endif

	irq_unlock(key);

	/* Fill return handle if needed, otherwise free handle. */
	if (ret_handle != NULL) {
		*ret_handle = ret;
	} else {
		k_free(ret);
	}

	LOG_DBG("Connected src %d to int %d (cpu %d)", source, intr, cpu);

	return 0;
}

int esp_intr_alloc(int source,
		int flags,
		intr_handler_t handler,
		void *arg,
		intr_handle_t *ret_handle)
{
	/*
	 * As an optimization, we can create a table with the possible interrupt status
	 * registers and masks for every single source there is. We can then add code here to
	 * look up an applicable value and pass that to the esp_intr_alloc_intrstatus function.
	 */
	return esp_intr_alloc_intrstatus(source, flags, 0, 0, handler, arg, ret_handle);
}

int IRAM_ATTR esp_intr_set_in_iram(intr_handle_t handle, bool is_in_iram)
{
	if (!handle) {
		return -EINVAL;
	}
	struct vector_desc_t *vd = handle->vector_desc;

	if (vd->flags & VECDESC_FL_SHARED) {
		return -EINVAL;
	}
	unsigned int key = irq_lock();
	uint32_t mask = (1 << vd->intno);

	if (is_in_iram) {
		vd->flags |= VECDESC_FL_INIRAM;
		non_iram_int_mask[vd->cpu] &= ~mask;
	} else {
		vd->flags &= ~VECDESC_FL_INIRAM;
		non_iram_int_mask[vd->cpu] |= mask;
	}
	irq_unlock(key);
	return 0;
}

int esp_intr_free(intr_handle_t handle)
{
	bool free_shared_vector = false;

	if (!handle) {
		return -EINVAL;
	}

	unsigned int key = irq_lock();
	esp_intr_disable(handle);
	if (handle->vector_desc->flags & VECDESC_FL_SHARED) {
		/* Find and kill the shared int */
		struct shared_vector_desc_t *svd = handle->vector_desc->shared_vec_info;
		struct shared_vector_desc_t *prevsvd = NULL;

		assert(svd); /* should be something in there for a shared int */
		while (svd != NULL) {
			if (svd == handle->shared_vector_desc) {
				/* Found it. Now kill it. */
				if (prevsvd) {
					prevsvd->next = svd->next;
				} else {
					handle->vector_desc->shared_vec_info = svd->next;
				}
				k_free(svd);
				break;
			}
			prevsvd = svd;
			svd = svd->next;
		}
		/* If nothing left, disable interrupt. */
		if (handle->vector_desc->shared_vec_info == NULL) {
			free_shared_vector = true;
		}
		INTC_LOG("%s: Deleting shared int: %s. "
			"Shared int is %s", __func__, svd ? "not found or last one" : "deleted",
			free_shared_vector ? "empty now." : "still in use");
	}

	if ((handle->vector_desc->flags & VECDESC_FL_NONSHARED) || free_shared_vector) {
		INTC_LOG("%s: Disabling int, killing handler", __func__);

		/* Disable interrupt to avoid assert at IRQ install */
		irq_disable(handle->vector_desc->intno);

		/* Reset IRQ handler */
		irq_connect_dynamic(handle->vector_desc->intno, 0,
				      (intc_dyn_handler_t)z_irq_spurious,
				      (void *)((int)handle->vector_desc->intno), 0);
		/*
		 * Theoretically, we could free the vector_desc... not sure if that's worth the
		 * few bytes of memory we save.(We can also not use the same exit path for empty
		 * shared ints anymore if we delete the desc.) For now, just mark it as free.
		 */
		handle->vector_desc->flags &=
			~(VECDESC_FL_NONSHARED | VECDESC_FL_RESERVED | VECDESC_FL_SHARED);
#if SOC_CPU_HAS_FLEXIBLE_INTC
		handle->vector_desc->flags &= ~(VECDESC_FL_LEVEL_MASK << VECDESC_FL_LEVEL_SHIFT);
#endif
		handle->vector_desc->source = ETS_INTERNAL_UNUSED_INTR_SOURCE;
		/* Also kill non_iram mask bit. */
		non_iram_int_mask[handle->vector_desc->cpu] &= ~(1 << (handle->vector_desc->intno));
	}
	irq_unlock(key);
	k_free(handle);
	return 0;
}

int esp_intr_get_intno(intr_handle_t handle)
{
	if (handle == NULL || handle->vector_desc == NULL) {
		return -1;
	}
	return handle->vector_desc->intno;
}

int esp_intr_get_cpu(intr_handle_t handle)
{
	if (handle == NULL || handle->vector_desc == NULL) {
		return -1;
	}
	return handle->vector_desc->cpu;
}

/**
 * Interrupt disabling strategy:
 * If the source is >=0 (meaning a muxed interrupt), we disable it by muxing the interrupt to a
 * non-connected interrupt. If the source is <0 (meaning an internal, per-cpu interrupt).
 * This allows us to, for the muxed CPUs, disable an int from
 * the other core. It also allows disabling shared interrupts.
 */

/*
 * Muxing an interrupt source to interrupt 6, 7, 11, 15, 16 or 29
 * cause the interrupt to effectively be disabled.
 */
#define INT_MUX_DISABLED_INTNO 6

int IRAM_ATTR esp_intr_enable(intr_handle_t handle)
{
	if (!handle) {
		return -EINVAL;
	}
	unsigned int key = irq_lock();
	int source;

	if (handle->shared_vector_desc) {
		handle->shared_vector_desc->disabled = 0;
		source = handle->shared_vector_desc->source;
	} else {
		source = handle->vector_desc->source;
	}
	if (source >= 0) {
		/* Disabled using int matrix; re-connect to enable */
		esp_rom_route_intr_matrix(handle->vector_desc->cpu, source,
			handle->vector_desc->intno);
	} else {
		/* Re-enable using cpu int ena reg */
		if (handle->vector_desc->cpu != esp_cpu_get_core_id()) {
			irq_unlock(key);
			return -EINVAL; /* Can only enable these ints on this cpu */
		}
		irq_enable(handle->vector_desc->intno);
	}
	irq_unlock(key);
	return 0;
}

int IRAM_ATTR esp_intr_disable(intr_handle_t handle)
{
	if (!handle) {
		return -EINVAL;
	}
	unsigned int key = irq_lock();
	int source;
	bool disabled = true;

	if (handle->shared_vector_desc) {
		handle->shared_vector_desc->disabled = 1;
		source = handle->shared_vector_desc->source;

		struct shared_vector_desc_t *svd = handle->vector_desc->shared_vec_info;

		assert(svd != NULL);
		while (svd) {
			if (svd->source == source && svd->disabled == 0) {
				disabled = false;
				break;
			}
			svd = svd->next;
		}
	} else {
		source = handle->vector_desc->source;
	}

	if (source >= 0) {
		if (disabled) {
			/* Disable using int matrix */
			esp_rom_route_intr_matrix(handle->vector_desc->cpu, source,
				INT_MUX_DISABLED_INTNO);
		}
	} else {
		/* Disable using per-cpu regs */
		if (handle->vector_desc->cpu != esp_cpu_get_core_id()) {
			irq_unlock(key);
			return -EINVAL; /* Can only enable these ints on this cpu */
		}
		irq_disable(handle->vector_desc->intno);
	}
	irq_unlock(key);
	return 0;
}

void IRAM_ATTR esp_intr_noniram_disable(void)
{
	unsigned int key = irq_lock();
	int oldint;
	int cpu = esp_cpu_get_core_id();
	int non_iram_ints = non_iram_int_mask[cpu];

	if (non_iram_int_disabled_flag[cpu]) {
		abort();
	}
	non_iram_int_disabled_flag[cpu] = true;
	oldint = esp_cpu_intr_get_enabled_mask();
	esp_cpu_intr_disable(non_iram_ints);
	rtc_isr_noniram_disable(cpu);
	/* Save which ints we did disable */
	non_iram_int_disabled[cpu] = oldint & non_iram_ints;
	irq_unlock(key);
}

void IRAM_ATTR esp_intr_noniram_enable(void)
{
	unsigned int key = irq_lock();
	int cpu = esp_cpu_get_core_id();
	int non_iram_ints = non_iram_int_disabled[cpu];

	if (!non_iram_int_disabled_flag[cpu]) {
		abort();
	}
	non_iram_int_disabled_flag[cpu] = false;
	esp_cpu_intr_enable(non_iram_ints);
	rtc_isr_noniram_enable(cpu);
	irq_unlock(key);
}

#if defined(CONFIG_RISCV)
/*
 * Functions below are implemented to keep consistency with current
 * Xtensa chips API behavior. When accessing Zephyr's API
 * directly, the CPU IRQs can be enabled or disabled directly. This
 * is mostly used to control lines that are not muxed, thus bypass the
 * interrupt matrix. For RISCV, these functions are not expected to
 * be used via user API, as peripherals are all routed through INTMUX
 * and shared interrupts require managing sources state.
 */
void arch_irq_enable(unsigned int irq)
{
	esp_cpu_intr_enable(1 << irq);
}

void arch_irq_disable(unsigned int irq)
{
	esp_cpu_intr_disable(1 << irq);
}

int arch_irq_is_enabled(unsigned int irq)
{
	/* The z_isr_install() assert queries this with the isr table index,
	 * which on a SoC that reserves entries sits above the line the enable
	 * mask uses, so a raw shift runs past the end of the mask. Enable and
	 * disable are called with the line itself and need no adjustment.
	 */
#ifdef CONFIG_RISCV_RESERVED_IRQ_ISR_TABLES_OFFSET
	irq -= CONFIG_RISCV_RESERVED_IRQ_ISR_TABLES_OFFSET;
#endif

	return !!(esp_cpu_intr_get_enabled_mask() & BIT(irq));
}
#endif
